In [ ]:
import pandas as pd

df = pd.read_excel('EVstock.xlsx')
lpdf1 = pd.read_excel('zero2nine.xlsx')
lpdf2 = pd.read_excel('nine2eighteen.xlsx')
lpdf3 = pd.read_excel('eighteen224.xlsx')

In [ ]:
lpdf1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 423 entries, 0 to 422
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   행정동명    423 non-null    object
 1   총생활인구수  423 non-null    float64
dtypes: float64(1), object(1)
memory usage: 6.7+ KB

In [ ]:
lpdf1.head(1)

   행정동명        총생활인구수
0  가락1동  25049.834033

In [ ]:
# 생활인구데이터에서 column의 이름을 수정해주십다.
lpdf1 = lpdf1.rename(columns={'행정동명' : 'dong'})
lpdf2 = lpdf2.rename(columns={'행정동명' : 'dong'})
lpdf3 = lpdf3.rename(columns={'행정동명' : 'dong'})

In [ ]:
# 잘바뀌었네요
lpdf2.head(1)

   dong        총생활인구수
0  가락1동  22118.931969

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 428 entries, 0 to 427
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  428 non-null    object
 1   ffnc        277 non-null    float64
 2   ffc         20 non-null     float64
 3   nfnc        146 non-null    float64
 4   nfc         50 non-null     float64
 5   fsnc        336 non-null    float64
 6   fsc         287 non-null    float64
 7   nsnc        299 non-null    float64
 8   nsc         196 non-null    float64
dtypes: float64(8), object(1)
memory usage: 30.2+ KB

In [ ]:
df.head()

  Unnamed: 0  ffnc  ffc  nfnc  nfc   fsnc   fsc  nsnc   nsc
0        공덕동   1.0  NaN   NaN  NaN   25.0  10.0   8.0  17.0
1       삼성8동   NaN  NaN   NaN  NaN    1.0   NaN   NaN   NaN
2        가산동  31.0  NaN   4.0  6.0  164.0   8.0  43.0  21.0
3       일원1동   1.0  NaN   NaN  NaN    NaN   NaN   1.0   NaN
4       방이1동   NaN  NaN   NaN  NaN    NaN   4.0   8.0   NaN

In [ ]:
df = df.rename(columns = {'Unnamed: 0' : 'dong' })

In [ ]:
df.head(1)

  dong  ffnc  ffc  nfnc  nfc  fsnc   fsc  nsnc   nsc
0  공덕동   1.0  NaN   NaN  NaN  25.0  10.0   8.0  17.0

In [ ]:
# dong기준으로 생활인구데이터와 EVstock 데이터를 합쳐줍시다,
tdf1 = pd.merge(lpdf1, df, how =  'right')

In [ ]:
tdf1.head()

   dong        총생활인구수  ffnc  ffc  nfnc  nfc   fsnc   fsc  nsnc   nsc
0   공덕동  34963.436019   1.0  NaN   NaN  NaN   25.0  10.0   8.0  17.0
1  삼성8동           NaN   NaN  NaN   NaN  NaN    1.0   NaN   NaN   NaN
2   가산동  40838.242876  31.0  NaN   4.0  6.0  164.0   8.0  43.0  21.0
3  일원1동  14630.722211   1.0  NaN   NaN  NaN    NaN   NaN   1.0   NaN
4  방이1동  15571.273720   NaN  NaN   NaN  NaN    NaN   4.0   8.0   NaN

In [ ]:
tdf1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 428 entries, 0 to 427
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dong    428 non-null    object
 1   총생활인구수  415 non-null    float64
 2   ffnc    277 non-null    float64
 3   ffc     20 non-null     float64
 4   nfnc    146 non-null    float64
 5   nfc     50 non-null     float64
 6   fsnc    336 non-null    float64
 7   fsc     287 non-null    float64
 8   nsnc    299 non-null    float64
 9   nsc     196 non-null    float64
dtypes: float64(9), object(1)
memory usage: 36.8+ KB

In [ ]:
# 총생활인구수랑 행정동수랑 매칭이 안되네요...
# 삼성8동같은경우는 행정동도 법정동도 아닌데 왜 이런일이...ㅠ
# 그래도 천천히 확인해봅시다.

In [ ]:
tdf1 = tdf1.fillna(0)

In [ ]:
testdf = tdf1[tdf1['총생활인구수'] == 0]

In [ ]:
testdf['dong'].value_counts()

항동       1
삼성7동     1
삼성3동     1
당산제2동    1
삼성4동     1
상일1동     1
금호동      1
상일2동     1
삼성5동     1
원료로2동    1
삼성6동     1
양평동      1
삼성8동     1
Name: dong, dtype: int64

In [ ]:
# 항동은 행정동인데, 생활인구 데이테에서 항동데이터가 존재하지 않네여..
# 당산제2동 -> 당산2동
# 상일1동, 상일2동 상일동(법정동)의 행정동은 상일1동 상일2동인데, 생홯인구데이터에서는 법정동으로 존재
# 상일동만 예외적으로 법정동으로 표기하겠습니다.
# 삼성 7동, 삼성8동, 삼성 5동, 삼성 6동 존재 x # excel입력당시 자동함수로 채워진것 같음
# 금호동 <- 법정동 
# 원료로동. 원효로동인데 오타남.
# 양평동 <- 법정동임.

In [ ]:
#이전에 seoulEVstock 데이터를 수정후 다시 EVstock데이터를 만들겠습니다.
# 수작업과 이전에 사용했던 함수를 이용해서 만들었습니다.

In [ ]:
df = pd.read_excel('EVstock1.xlsx')

In [ ]:
df.head()

  Unnamed: 0  ffnc  ffc  nfnc  nfc  fsnc   fsc  nsnc   nsc
0      신대방1동   1.0  NaN   1.0  NaN   5.0  13.0   5.0  13.0
1       시흥5동   NaN  NaN   NaN  NaN   NaN   2.0   1.0   NaN
2        청담동   1.0  NaN   NaN  2.0  13.0  19.0  26.0   NaN
3       신정4동   NaN  NaN   2.0  NaN   9.0   2.0   NaN   NaN
4         항동   NaN  NaN   NaN  NaN   NaN  11.0   9.0  10.0

In [ ]:
df = df.rename(columns= {'Unnamed: 0' : 'dong'})

In [ ]:
tdf1 = pd.merge(lpdf1, df, how =  'right')

In [ ]:
tdf1 = tdf1.fillna(0)
testdf = tdf1[tdf1['총생활인구수'] == 0]
testdf['dong'].value_counts()
# 항동은 행정동코드에 누락되었으므로 삭제 하겠습니다..

항동    1
Name: dong, dtype: int64

In [ ]:
tdf1.info()
# 417개네여.. 행정동매칭정보에 있는 행정동 갯수는 424개인데 말이죠...
# 전체 행정동은 426개인데, (상일1동 상일2동이 상일동으로 묶여있고, 항동이 누락되어있음)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 0 to 416
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dong    417 non-null    object
 1   총생활인구수  417 non-null    float64
 2   ffnc    417 non-null    float64
 3   ffc     417 non-null    float64
 4   nfnc    417 non-null    float64
 5   nfc     417 non-null    float64
 6   fsnc    417 non-null    float64
 7   fsc     417 non-null    float64
 8   nsnc    417 non-null    float64
 9   nsc     417 non-null    float64
dtypes: float64(9), object(1)
memory usage: 35.8+ KB

In [ ]:
tdf1.head()

    dong        총생활인구수  ffnc  ffc  nfnc  nfc  fsnc   fsc  nsnc   nsc
0  신대방1동  15327.106516   1.0  0.0   1.0  0.0   5.0  13.0   5.0  13.0
1   시흥5동  10758.533521   0.0  0.0   0.0  0.0   0.0   2.0   1.0   0.0
2    청담동  31961.769501   1.0  0.0   0.0  2.0  13.0  19.0  26.0   0.0
3   신정4동  28304.621036   0.0  0.0   2.0  0.0   9.0   2.0   0.0   0.0
4     항동      0.000000   0.0  0.0   0.0  0.0   0.0  11.0   9.0  10.0

In [ ]:
# 행정동코드_매칭정보.xlsx를 불러와 어떤 동이 빠져있는지 확인해봅시다.
refdf = pd.read_excel('행정동코드_매칭정보.xlsx')

In [ ]:
refdf.head(2)

    통계청행정동코드  행자부행정동코드    시도명   시군구명      행정동명
0  H_SDNG_CD  H_DNG_CD  DO_NM  CT_NM  H_DNG_NM
1    1101053  11110530     서울    종로구       사직동

In [ ]:
refdf.iloc[1,4]

'사직동'

In [ ]:
a = 0
for i in range(1,len(refdf)):
  b = refdf.iloc[i,4] # 행정동코드의 행정동명
  if len(tdf1[tdf1['dong'] == str(b)]) == 1: # 일치하는게 1개 있다면~
    a = a + 1
  elif len(tdf1[tdf1['dong'] == str(b)]) >= 2: # 만약 중복되는게 있다면~
    print('overlap:', b)
  else:
    print(b) # 하나도 없다면~
print(a) # 행정동코드의 동과 tdf1에서의 동이 일치하는 갯수

# 아래 동내에는 행정동코드에는 있지만 저희가 만든 데이터에 없는 동 들입니다. 무엇이 문제인지 확인해보겠습니다.
# 충격적이게도 아래 동에는 전기차 충전소가 하나도 없네여..

창신2동
방학2동
갈현1동
독산2동
대림2동
서림동
석촌동
417

항동    1
Name: dong, dtype: int64

In [ ]:
# 생활인구 기준으로 데이터를 만듭시다. 그러면 충전기가 아예 없는 동도 확인 가능하기 때문입니다.
tdf2 = pd.merge(df,lpdf1, how = 'right')

In [ ]:
tdf2.head()

   dong  ffnc  ffc  nfnc  nfc   fsnc   fsc  nsnc   nsc        총생활인구수
0  가락1동   7.0  NaN   NaN  NaN   27.0   NaN   1.0   NaN  25049.834033
1  가락2동   5.0  1.0   NaN  NaN    4.0   2.0   4.0   NaN  24935.653890
2  가락본동   1.0  NaN   NaN  NaN   24.0  19.0   2.0   6.0  33157.590517
3  가리봉동   1.0  NaN   1.0  NaN    1.0   NaN  37.0   NaN  11048.837409
4   가산동  31.0  NaN   4.0  6.0  164.0   8.0  43.0  21.0  40838.242876

In [ ]:
tdf2.info()
# 행정동 매칭코드에 나와있는 행정동 갯수는 424개인데 1개가 누락이 되었네요,

<class 'pandas.core.frame.DataFrame'>
Int64Index: 423 entries, 0 to 422
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dong    423 non-null    object
 1   ffnc    276 non-null    float64
 2   ffc     20 non-null     float64
 3   nfnc    146 non-null    float64
 4   nfc     50 non-null     float64
 5   fsnc    327 non-null    float64
 6   fsc     284 non-null    float64
 7   nsnc    298 non-null    float64
 8   nsc     195 non-null    float64
 9   총생활인구수  423 non-null    float64
dtypes: float64(9), object(1)
memory usage: 36.4+ KB

In [ ]:
a = 0
for i in range(0,len(tdf2)):
  b = tdf2.iloc[i,0] # tdf2의 행정동명
  if len(refdf[refdf['행정동명'] == str(b)]) == 1: # 일치하는게 1개 있다면~
    a = a + 1
  elif len(refdf[refdf['행정동명'] == str(b)]) >= 2: # 만약 중복되는게 있다면~
    print('overlap:', b)
  else:
    print(b) # 하나도 없다면~
print(a) # 행정동코드의 동과 tdf1에서의 동이 일치하는 갯수

overlap: 신사동
422

In [ ]:
#신사동은 강남에 1개, 관악에 1개가 있네요....... 
# 이름이 똑같은 동이 있을 줄이야 ㅠ 다음작업시에는 이런걸 확실히 따져봐야겠습니다.
# 신사동을 구분해서 다시 파일을 만들어야겠습니다.ㅠ

In [ ]:
# 구분한 파일을 가져옵니다.
df = pd.read_excel('EVstock1.xlsx')
refdf = pd.read_excel('행정동코드_매칭정보.xlsx')

In [ ]:
df.head()

  Unnamed: 0  ffnc  ffc  nfnc  nfc  fsnc   fsc  nsnc   nsc
0      신대방1동   1.0  NaN   1.0  NaN   5.0  13.0   5.0  13.0
1       시흥5동   NaN  NaN   NaN  NaN   NaN   2.0   1.0   NaN
2        청담동   1.0  NaN   NaN  2.0  13.0  19.0  26.0   NaN
3       신정4동   NaN  NaN   2.0  NaN   9.0   2.0   NaN   NaN
4         항동   NaN  NaN   NaN  NaN   NaN  11.0   9.0  10.0

In [ ]:
df = df.rename(columns = {'Unnamed: 0': 'dong'})

In [ ]:
df029 = pd.merge(df, lpdf1, how = 'right')

In [ ]:
df029.head()

   dong  ffnc  ffc  nfnc  nfc   fsnc   fsc  nsnc   nsc        총생활인구수
0  가락1동   7.0  NaN   NaN  NaN   27.0   NaN   1.0   NaN  25049.834033
1  가락2동   5.0  1.0   NaN  NaN    4.0   2.0   4.0   NaN  24935.653890
2  가락본동   1.0  NaN   NaN  NaN   24.0  19.0   2.0   6.0  33157.590517
3  가리봉동   1.0  NaN   1.0  NaN    1.0   NaN  37.0   NaN  11048.837409
4   가산동  31.0  NaN   4.0  6.0  164.0   8.0  43.0  21.0  40838.242876

In [ ]:
df029.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 423 entries, 0 to 422
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dong    423 non-null    object
 1   ffnc    275 non-null    float64
 2   ffc     20 non-null     float64
 3   nfnc    146 non-null    float64
 4   nfc     50 non-null     float64
 5   fsnc    326 non-null    float64
 6   fsc     283 non-null    float64
 7   nsnc    298 non-null    float64
 8   nsc     195 non-null    float64
 9   총생활인구수  423 non-null    float64
dtypes: float64(9), object(1)
memory usage: 36.4+ KB

In [ ]:
# 아래 코드를 함수로 만들면어도 좋았을것 같네영..ㅎㅎ
a = 0
for i in range(0,len(df029)):
  b = df029.iloc[i,0] 
  if len(refdf[refdf['행정동명'] == str(b)]) == 1: # 일치하는게 1개 있다면~
    a = a + 1
  elif len(refdf[refdf['행정동명'] == str(b)]) >= 2: # 만약 중복되는게 있다면~
    print('overlap:', b)
  else:
    print(b) # 하나도 없다면~
print(a) # 행정동코드의 동과 tdf1에서의 동이 일치하는 갯수

#중복되는게 없는 것을 확인 할 수 있네요!
# 424개가 나와야하는데 무슨 문제일까요,,,

423

In [ ]:
a = 0
for i in range(0,len(refdf)):
  b = refdf.iloc[i,4] 
  if len(df029[df029['dong'] == str(b)]) == 1: # 일치하는게 1개 있다면~
    a = a + 1
  elif len(df029[df029['dong'] == str(b)]) >= 2: # 만약 중복되는게 있다면~
    print('overlap:', b)
  else:
    print(b) # 하나도 없다면~
print(a) # 행정동코드의 동과 tdf1에서의 동이 일치하는 갯수

# 생활인구 데이터에서 신사동(관악)을 구분해야하는데 그렇지 못했네요 ㅠ

H_DNG_NM
신사동(관악)
423

In [ ]:
# 다시만든 생활인구 데이터를 가져오겠습니다.